espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SARADC_REG_H_
#define _SOC_SARADC_REG_H_


#include "soc.h"
#define SARADC_SAR_READ_CTRL_REG          (DR_REG_SARADC_BASE + 0x0000)
/* SARADC_SAR1_DATA_INV : R/W ;bitpos:[28] ;default: 1'd0 ; */
/*description: Invert SAR ADC1 data*/
#define SARADC_SAR1_DATA_INV  (BIT(28))
#define SARADC_SAR1_DATA_INV_M  (BIT(28))
#define SARADC_SAR1_DATA_INV_V  0x1
#define SARADC_SAR1_DATA_INV_S  28
/* SARADC_SAR1_DIG_FORCE : R/W ;bitpos:[27] ;default: 1'd0 ; */
/*description: 1: SAR ADC1 controlled by DIG ADC1 CTRL  0: SAR ADC1 controlled by RTC ADC1 CTRL*/
#define SARADC_SAR1_DIG_FORCE  (BIT(27))
#define SARADC_SAR1_DIG_FORCE_M  (BIT(27))
#define SARADC_SAR1_DIG_FORCE_V  0x1
#define SARADC_SAR1_DIG_FORCE_S  27
/* SARADC_SAR1_SAMPLE_NUM : R/W ;bitpos:[26:19] ;default: 8'd0 ; */
/*description: */
#define SARADC_SAR1_SAMPLE_NUM  0x000000FF
#define SARADC_SAR1_SAMPLE_NUM_M  ((SARADC_SAR1_SAMPLE_NUM_V)<<(SARADC_SAR1_SAMPLE_NUM_S))
#define SARADC_SAR1_SAMPLE_NUM_V  0xFF
#define SARADC_SAR1_SAMPLE_NUM_S  19
/* SARADC_SAR1_CLK_GATED : R/W ;bitpos:[18] ;default: 1'b1 ; */
/*description: */
#define SARADC_SAR1_CLK_GATED  (BIT(18))
#define SARADC_SAR1_CLK_GATED_M  (BIT(18))
#define SARADC_SAR1_CLK_GATED_V  0x1
#define SARADC_SAR1_CLK_GATED_S  18
/* SARADC_SAR1_SAMPLE_BIT : R/W ;bitpos:[17:16] ;default: 2'd3 ; */
/*description: 00: for 9-bit width  01: for 10-bit width  10: for 11-bit width
  11: for 12-bit width*/
#define SARADC_SAR1_SAMPLE_BIT  0x00000003
#define SARADC_SAR1_SAMPLE_BIT_M  ((SARADC_SAR1_SAMPLE_BIT_V)<<(SARADC_SAR1_SAMPLE_BIT_S))
#define SARADC_SAR1_SAMPLE_BIT_V  0x3
#define SARADC_SAR1_SAMPLE_BIT_S  16
/* SARADC_SAR1_SAMPLE_CYCLE : R/W ;bitpos:[15:8] ;default: 8'd9 ; */
/*description: sample cycles for SAR ADC1*/
#define SARADC_SAR1_SAMPLE_CYCLE  0x000000FF
#define SARADC_SAR1_SAMPLE_CYCLE_M  ((SARADC_SAR1_SAMPLE_CYCLE_V)<<(SARADC_SAR1_SAMPLE_CYCLE_S))
#define SARADC_SAR1_SAMPLE_CYCLE_V  0xFF
#define SARADC_SAR1_SAMPLE_CYCLE_S  8
/* SARADC_SAR1_CLK_DIV : R/W ;bitpos:[7:0] ;default: 8'd2 ; */
/*description: clock divider*/
#define SARADC_SAR1_CLK_DIV  0x000000FF
#define SARADC_SAR1_CLK_DIV_M  ((SARADC_SAR1_CLK_DIV_V)<<(SARADC_SAR1_CLK_DIV_S))
#define SARADC_SAR1_CLK_DIV_V  0xFF
#define SARADC_SAR1_CLK_DIV_S  0

#define SARADC_SAR_READ_STATUS1_REG          (DR_REG_SARADC_BASE + 0x0004)
/* SARADC_SAR1_READER_STATUS : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SARADC_SAR1_READER_STATUS  0xFFFFFFFF
#define SARADC_SAR1_READER_STATUS_M  ((SARADC_SAR1_READER_STATUS_V)<<(SARADC_SAR1_READER_STATUS_S))
#define SARADC_SAR1_READER_STATUS_V  0xFFFFFFFF
#define SARADC_SAR1_READER_STATUS_S  0

#define SARADC_SAR_MEAS_WAIT1_REG          (DR_REG_SARADC_BASE + 0x0008)
/* SARADC_SAR_AMP_WAIT2 : R/W ;bitpos:[31:16] ;default: 16'd10 ; */
/*description: */
#define SARADC_SAR_AMP_WAIT2  0x0000FFFF
#define SARADC_SAR_AMP_WAIT2_M  ((SARADC_SAR_AMP_WAIT2_V)<<(SARADC_SAR_AMP_WAIT2_S))
#define SARADC_SAR_AMP_WAIT2_V  0xFFFF
#define SARADC_SAR_AMP_WAIT2_S  16
/* SARADC_SAR_AMP_WAIT1 : R/W ;bitpos:[15:0] ;default: 16'd10 ; */
/*description: */
#define SARADC_SAR_AMP_WAIT1  0x0000FFFF
#define SARADC_SAR_AMP_WAIT1_M  ((SARADC_SAR_AMP_WAIT1_V)<<(SARADC_SAR_AMP_WAIT1_S))
#define SARADC_SAR_AMP_WAIT1_V  0xFFFF
#define SARADC_SAR_AMP_WAIT1_S  0

#define SARADC_SAR_MEAS_WAIT2_REG          (DR_REG_SARADC_BASE + 0x000c)
/* SARADC_SAR2_RSTB_WAIT : R/W ;bitpos:[27:20] ;default: 8'd2 ; */
/*description: */
#define SARADC_SAR2_RSTB_WAIT  0x000000FF
#define SARADC_SAR2_RSTB_WAIT_M  ((SARADC_SAR2_RSTB_WAIT_V)<<(SARADC_SAR2_RSTB_WAIT_S))
#define SARADC_SAR2_RSTB_WAIT_V  0xFF
#define SARADC_SAR2_RSTB_WAIT_S  20
/* SARADC_FORCE_XPD_SAR : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: */
#define SARADC_FORCE_XPD_SAR  0x00000003
#define SARADC_FORCE_XPD_SAR_M  ((SARADC_FORCE_XPD_SAR_V)<<(SARADC_FORCE_XPD_SAR_S))
#define SARADC_FORCE_XPD_SAR_V  0x3
#define SARADC_FORCE_XPD_SAR_S  18
/* SARADC_FORCE_XPD_AMP : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: */
#define SARADC_FORCE_XPD_AMP  0x00000003
#define SARADC_FORCE_XPD_AMP_M  ((SARADC_FORCE_XPD_AMP_V)<<(SARADC_FORCE_XPD_AMP_S))
#define SARADC_FORCE_XPD_AMP_V  0x3
#define SARADC_FORCE_XPD_AMP_S  16
/* SARADC_SAR_AMP_WAIT3 : R/W ;bitpos:[15:0] ;default: 16'd10 ; */
/*description: */
#define SARADC_SAR_AMP_WAIT3  0x0000FFFF
#define SARADC_SAR_AMP_WAIT3_M  ((SARADC_SAR_AMP_WAIT3_V)<<(SARADC_SAR_AMP_WAIT3_S))
#define SARADC_SAR_AMP_WAIT3_V  0xFFFF
#define SARADC_SAR_AMP_WAIT3_S  0

#define SARADC_SAR_MEAS_CTRL_REG          (DR_REG_SARADC_BASE + 0x0010)
/* SARADC_SAR2_XPD_WAIT : R/W ;bitpos:[31:24] ;default: 8'h7 ; */
/*description: */
#define SARADC_SAR2_XPD_WAIT  0x000000FF
#define SARADC_SAR2_XPD_WAIT_M  ((SARADC_SAR2_XPD_WAIT_V)<<(SARADC_SAR2_XPD_WAIT_S))
#define SARADC_SAR2_XPD_WAIT_V  0xFF
#define SARADC_SAR2_XPD_WAIT_S  24
/* SARADC_SAR_RSTB_FSM : R/W ;bitpos:[23:20] ;default: 4'b0000 ; */
/*description: */
#define SARADC_SAR_RSTB_FSM  0x0000000F
#define SARADC_SAR_RSTB_FSM_M  ((SARADC_SAR_RSTB_FSM_V)<<(SARADC_SAR_RSTB_FSM_S))
#define SARADC_SAR_RSTB_FSM_V  0xF
#define SARADC_SAR_RSTB_FSM_S  20
/* SARADC_XPD_SAR_FSM : R/W ;bitpos:[19:16] ;default: 4'b0111 ; */
/*description: */
#define SARADC_XPD_SAR_FSM  0x0000000F
#define SARADC_XPD_SAR_FSM_M  ((SARADC_XPD_SAR_FSM_V)<<(SARADC_XPD_SAR_FSM_S))
#define SARADC_XPD_SAR_FSM_V  0xF
#define SARADC_XPD_SAR_FSM_S  16
/* SARADC_AMP_SHORT_REF_GND_FSM : R/W ;bitpos:[15:12] ;default: 4'b0011 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_GND_FSM  0x0000000F
#define SARADC_AMP_SHORT_REF_GND_FSM_M  ((SARADC_AMP_SHORT_REF_GND_FSM_V)<<(SARADC_AMP_SHORT_REF_GND_FSM_S))
#define SARADC_AMP_SHORT_REF_GND_FSM_V  0xF
#define SARADC_AMP_SHORT_REF_GND_FSM_S  12
/* SARADC_AMP_SHORT_REF_FSM : R/W ;bitpos:[11:8] ;default: 4'b0011 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_FSM  0x0000000F
#define SARADC_AMP_SHORT_REF_FSM_M  ((SARADC_AMP_SHORT_REF_FSM_V)<<(SARADC_AMP_SHORT_REF_FSM_S))
#define SARADC_AMP_SHORT_REF_FSM_V  0xF
#define SARADC_AMP_SHORT_REF_FSM_S  8
/* SARADC_AMP_RST_FB_FSM : R/W ;bitpos:[7:4] ;default: 4'b1000 ; */
/*description: */
#define SARADC_AMP_RST_FB_FSM  0x0000000F
#define SARADC_AMP_RST_FB_FSM_M  ((SARADC_AMP_RST_FB_FSM_V)<<(SARADC_AMP_RST_FB_FSM_S))
#define SARADC_AMP_RST_FB_FSM_V  0xF
#define SARADC_AMP_RST_FB_FSM_S  4
/* SARADC_XPD_SAR_AMP_FSM : R/W ;bitpos:[3:0] ;default: 4'b1111 ; */
/*description: */
#define SARADC_XPD_SAR_AMP_FSM  0x0000000F
#define SARADC_XPD_SAR_AMP_FSM_M  ((SARADC_XPD_SAR_AMP_FSM_V)<<(SARADC_XPD_SAR_AMP_FSM_S))
#define SARADC_XPD_SAR_AMP_FSM_V  0xF
#define SARADC_XPD_SAR_AMP_FSM_S  0

#define SARADC_SAR_READ_STATUS2_REG          (DR_REG_SARADC_BASE + 0x0014)
/* SARADC_SAR2_READER_STATUS : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SARADC_SAR2_READER_STATUS  0xFFFFFFFF
#define SARADC_SAR2_READER_STATUS_M  ((SARADC_SAR2_READER_STATUS_V)<<(SARADC_SAR2_READER_STATUS_S))
#define SARADC_SAR2_READER_STATUS_V  0xFFFFFFFF
#define SARADC_SAR2_READER_STATUS_S  0

