espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
#define SARADC_ULP_CP_SLEEP_CYC0_REG          (DR_REG_SARADC_BASE + 0x0018)
/* SARADC_SLEEP_CYCLES_S0 : R/W ;bitpos:[31:0] ;default: 32'd200 ; */
/*description: sleep cycles for ULP-coprocessor timer*/
#define SARADC_SLEEP_CYCLES_S0  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S0_M  ((SARADC_SLEEP_CYCLES_S0_V)<<(SARADC_SLEEP_CYCLES_S0_S))
#define SARADC_SLEEP_CYCLES_S0_V  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S0_S  0

#define SARADC_ULP_CP_SLEEP_CYC1_REG          (DR_REG_SARADC_BASE + 0x001c)
/* SARADC_SLEEP_CYCLES_S1 : R/W ;bitpos:[31:0] ;default: 32'd100 ; */
/*description: */
#define SARADC_SLEEP_CYCLES_S1  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S1_M  ((SARADC_SLEEP_CYCLES_S1_V)<<(SARADC_SLEEP_CYCLES_S1_S))
#define SARADC_SLEEP_CYCLES_S1_V  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S1_S  0

#define SARADC_ULP_CP_SLEEP_CYC2_REG          (DR_REG_SARADC_BASE + 0x0020)
/* SARADC_SLEEP_CYCLES_S2 : R/W ;bitpos:[31:0] ;default: 32'd50 ; */
/*description: */
#define SARADC_SLEEP_CYCLES_S2  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S2_M  ((SARADC_SLEEP_CYCLES_S2_V)<<(SARADC_SLEEP_CYCLES_S2_S))
#define SARADC_SLEEP_CYCLES_S2_V  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S2_S  0

#define SARADC_ULP_CP_SLEEP_CYC3_REG          (DR_REG_SARADC_BASE + 0x0024)
/* SARADC_SLEEP_CYCLES_S3 : R/W ;bitpos:[31:0] ;default: 32'd40 ; */
/*description: */
#define SARADC_SLEEP_CYCLES_S3  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S3_M  ((SARADC_SLEEP_CYCLES_S3_V)<<(SARADC_SLEEP_CYCLES_S3_S))
#define SARADC_SLEEP_CYCLES_S3_V  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S3_S  0

#define SARADC_ULP_CP_SLEEP_CYC4_REG          (DR_REG_SARADC_BASE + 0x0028)
/* SARADC_SLEEP_CYCLES_S4 : R/W ;bitpos:[31:0] ;default: 32'd20 ; */
/*description: */
#define SARADC_SLEEP_CYCLES_S4  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S4_M  ((SARADC_SLEEP_CYCLES_S4_V)<<(SARADC_SLEEP_CYCLES_S4_S))
#define SARADC_SLEEP_CYCLES_S4_V  0xFFFFFFFF
#define SARADC_SLEEP_CYCLES_S4_S  0

#define SARADC_SAR_START_FORCE_REG          (DR_REG_SARADC_BASE + 0x002c)
/* SARADC_SAR2_PWDET_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: N/A*/
#define SARADC_SAR2_PWDET_EN  (BIT(24))
#define SARADC_SAR2_PWDET_EN_M  (BIT(24))
#define SARADC_SAR2_PWDET_EN_V  0x1
#define SARADC_SAR2_PWDET_EN_S  24
/* SARADC_SAR1_STOP : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: stop SAR ADC1 conversion*/
#define SARADC_SAR1_STOP  (BIT(23))
#define SARADC_SAR1_STOP_M  (BIT(23))
#define SARADC_SAR1_STOP_V  0x1
#define SARADC_SAR1_STOP_S  23
/* SARADC_SAR2_STOP : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: stop SAR ADC2 conversion*/
#define SARADC_SAR2_STOP  (BIT(22))
#define SARADC_SAR2_STOP_M  (BIT(22))
#define SARADC_SAR2_STOP_V  0x1
#define SARADC_SAR2_STOP_S  22
/* SARADC_PC_INIT : R/W ;bitpos:[21:11] ;default: 11'b0 ; */
/*description: initialized PC for ULP-coprocessor*/
#define SARADC_PC_INIT  0x000007FF
#define SARADC_PC_INIT_M  ((SARADC_PC_INIT_V)<<(SARADC_PC_INIT_S))
#define SARADC_PC_INIT_V  0x7FF
#define SARADC_PC_INIT_S  11
/* SARADC_SARCLK_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SARADC_SARCLK_EN  (BIT(10))
#define SARADC_SARCLK_EN_M  (BIT(10))
#define SARADC_SARCLK_EN_V  0x1
#define SARADC_SARCLK_EN_S  10
/* SARADC_ULP_CP_START_TOP : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Write 1 to start ULP-coprocessor  only active when reg_ulp_cp_force_start_top
 = 1*/
#define SARADC_ULP_CP_START_TOP  (BIT(9))
#define SARADC_ULP_CP_START_TOP_M  (BIT(9))
#define SARADC_ULP_CP_START_TOP_V  0x1
#define SARADC_ULP_CP_START_TOP_S  9
/* SARADC_ULP_CP_FORCE_START_TOP : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: 1: ULP-coprocessor is started by SW  0: ULP-coprocessor is started by timer*/
#define SARADC_ULP_CP_FORCE_START_TOP  (BIT(8))
#define SARADC_ULP_CP_FORCE_START_TOP_M  (BIT(8))
#define SARADC_ULP_CP_FORCE_START_TOP_V  0x1
#define SARADC_ULP_CP_FORCE_START_TOP_S  8
/* SARADC_SAR2_PWDET_CCT : R/W ;bitpos:[7:5] ;default: 3'b0 ; */
/*description: SAR2_PWDET_CCT  PA power detector capacitance tuning.*/
#define SARADC_SAR2_PWDET_CCT  0x00000007
#define SARADC_SAR2_PWDET_CCT_M  ((SARADC_SAR2_PWDET_CCT_V)<<(SARADC_SAR2_PWDET_CCT_S))
#define SARADC_SAR2_PWDET_CCT_V  0x7
#define SARADC_SAR2_PWDET_CCT_S  5
/* SARADC_SAR2_EN_TEST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: SAR2_EN_TEST  only active when reg_sar2_dig_force = 0*/
#define SARADC_SAR2_EN_TEST  (BIT(4))
#define SARADC_SAR2_EN_TEST_M  (BIT(4))
#define SARADC_SAR2_EN_TEST_V  0x1
#define SARADC_SAR2_EN_TEST_S  4
/* SARADC_SAR2_BIT_WIDTH : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits*/
#define SARADC_SAR2_BIT_WIDTH  0x00000003
#define SARADC_SAR2_BIT_WIDTH_M  ((SARADC_SAR2_BIT_WIDTH_V)<<(SARADC_SAR2_BIT_WIDTH_S))
#define SARADC_SAR2_BIT_WIDTH_V  0x3
#define SARADC_SAR2_BIT_WIDTH_S  2
/* SARADC_SAR1_BIT_WIDTH : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits*/
#define SARADC_SAR1_BIT_WIDTH  0x00000003
#define SARADC_SAR1_BIT_WIDTH_M  ((SARADC_SAR1_BIT_WIDTH_V)<<(SARADC_SAR1_BIT_WIDTH_S))
#define SARADC_SAR1_BIT_WIDTH_V  0x3
#define SARADC_SAR1_BIT_WIDTH_S  0

#define SARADC_SAR_MEM_WR_CTRL_REG          (DR_REG_SARADC_BASE + 0x0030)
/* SARADC_RTC_MEM_WR_OFFST_CLR : WO ;bitpos:[22] ;default: 1'd0 ; */
/*description: */
#define SARADC_RTC_MEM_WR_OFFST_CLR  (BIT(22))
#define SARADC_RTC_MEM_WR_OFFST_CLR_M  (BIT(22))
#define SARADC_RTC_MEM_WR_OFFST_CLR_V  0x1
#define SARADC_RTC_MEM_WR_OFFST_CLR_S  22
/* SARADC_MEM_WR_ADDR_SIZE : R/W ;bitpos:[21:11] ;default: 11'd512 ; */
/*description: */
#define SARADC_MEM_WR_ADDR_SIZE  0x000007FF
#define SARADC_MEM_WR_ADDR_SIZE_M  ((SARADC_MEM_WR_ADDR_SIZE_V)<<(SARADC_MEM_WR_ADDR_SIZE_S))
#define SARADC_MEM_WR_ADDR_SIZE_V  0x7FF
#define SARADC_MEM_WR_ADDR_SIZE_S  11
/* SARADC_MEM_WR_ADDR_INIT : R/W ;bitpos:[10:0] ;default: 11'd512 ; */
/*description: */
#define SARADC_MEM_WR_ADDR_INIT  0x000007FF
#define SARADC_MEM_WR_ADDR_INIT_M  ((SARADC_MEM_WR_ADDR_INIT_V)<<(SARADC_MEM_WR_ADDR_INIT_S))
#define SARADC_MEM_WR_ADDR_INIT_V  0x7FF
#define SARADC_MEM_WR_ADDR_INIT_S  0

#define SARADC_SAR_ATTEN1_REG          (DR_REG_SARADC_BASE + 0x0034)
/* SARADC_SAR1_ATTEN : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */
/*description: 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB*/
#define SARADC_SAR1_ATTEN  0xFFFFFFFF
#define SARADC_SAR1_ATTEN_M  ((SARADC_SAR1_ATTEN_V)<<(SARADC_SAR1_ATTEN_S))
#define SARADC_SAR1_ATTEN_V  0xFFFFFFFF
#define SARADC_SAR1_ATTEN_S  0

