espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
#define SARADC_SAR_ATTEN2_REG          (DR_REG_SARADC_BASE + 0x0038)
/* SARADC_SAR2_ATTEN : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */
/*description: 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB*/
#define SARADC_SAR2_ATTEN  0xFFFFFFFF
#define SARADC_SAR2_ATTEN_M  ((SARADC_SAR2_ATTEN_V)<<(SARADC_SAR2_ATTEN_S))
#define SARADC_SAR2_ATTEN_V  0xFFFFFFFF
#define SARADC_SAR2_ATTEN_S  0

#define SARADC_SAR_SLAVE_ADDR1_REG          (DR_REG_SARADC_BASE + 0x003c)
/* SARADC_MEAS_STATUS : RO ;bitpos:[29:22] ;default: 8'h0 ; */
/*description: */
#define SARADC_MEAS_STATUS  0x000000FF
#define SARADC_MEAS_STATUS_M  ((SARADC_MEAS_STATUS_V)<<(SARADC_MEAS_STATUS_S))
#define SARADC_MEAS_STATUS_V  0xFF
#define SARADC_MEAS_STATUS_S  22
/* SARADC_I2C_SLAVE_ADDR0 : R/W ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR0  0x000007FF
#define SARADC_I2C_SLAVE_ADDR0_M  ((SARADC_I2C_SLAVE_ADDR0_V)<<(SARADC_I2C_SLAVE_ADDR0_S))
#define SARADC_I2C_SLAVE_ADDR0_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR0_S  11
/* SARADC_I2C_SLAVE_ADDR1 : R/W ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR1  0x000007FF
#define SARADC_I2C_SLAVE_ADDR1_M  ((SARADC_I2C_SLAVE_ADDR1_V)<<(SARADC_I2C_SLAVE_ADDR1_S))
#define SARADC_I2C_SLAVE_ADDR1_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR1_S  0

#define SARADC_SAR_SLAVE_ADDR2_REG          (DR_REG_SARADC_BASE + 0x0040)
/* SARADC_I2C_SLAVE_ADDR2 : R/W ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR2  0x000007FF
#define SARADC_I2C_SLAVE_ADDR2_M  ((SARADC_I2C_SLAVE_ADDR2_V)<<(SARADC_I2C_SLAVE_ADDR2_S))
#define SARADC_I2C_SLAVE_ADDR2_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR2_S  11
/* SARADC_I2C_SLAVE_ADDR3 : R/W ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR3  0x000007FF
#define SARADC_I2C_SLAVE_ADDR3_M  ((SARADC_I2C_SLAVE_ADDR3_V)<<(SARADC_I2C_SLAVE_ADDR3_S))
#define SARADC_I2C_SLAVE_ADDR3_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR3_S  0

#define SARADC_SAR_SLAVE_ADDR3_REG          (DR_REG_SARADC_BASE + 0x0044)
/* SARADC_TSENS_RDY_OUT : RO ;bitpos:[30] ;default: 1'h0 ; */
/*description: indicate temperature sensor out ready*/
#define SARADC_TSENS_RDY_OUT  (BIT(30))
#define SARADC_TSENS_RDY_OUT_M  (BIT(30))
#define SARADC_TSENS_RDY_OUT_V  0x1
#define SARADC_TSENS_RDY_OUT_S  30
/* SARADC_TSENS_OUT : RO ;bitpos:[29:22] ;default: 8'h0 ; */
/*description: temperature sensor data out*/
#define SARADC_TSENS_OUT  0x000000FF
#define SARADC_TSENS_OUT_M  ((SARADC_TSENS_OUT_V)<<(SARADC_TSENS_OUT_S))
#define SARADC_TSENS_OUT_V  0xFF
#define SARADC_TSENS_OUT_S  22
/* SARADC_I2C_SLAVE_ADDR4 : R/W ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR4  0x000007FF
#define SARADC_I2C_SLAVE_ADDR4_M  ((SARADC_I2C_SLAVE_ADDR4_V)<<(SARADC_I2C_SLAVE_ADDR4_S))
#define SARADC_I2C_SLAVE_ADDR4_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR4_S  11
/* SARADC_I2C_SLAVE_ADDR5 : R/W ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR5  0x000007FF
#define SARADC_I2C_SLAVE_ADDR5_M  ((SARADC_I2C_SLAVE_ADDR5_V)<<(SARADC_I2C_SLAVE_ADDR5_S))
#define SARADC_I2C_SLAVE_ADDR5_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR5_S  0

#define SARADC_SAR_SLAVE_ADDR4_REG          (DR_REG_SARADC_BASE + 0x0048)
/* SARADC_I2C_DONE : RO ;bitpos:[30] ;default: 1'h0 ; */
/*description: indicate I2C done*/
#define SARADC_I2C_DONE  (BIT(30))
#define SARADC_I2C_DONE_M  (BIT(30))
#define SARADC_I2C_DONE_V  0x1
#define SARADC_I2C_DONE_S  30
/* SARADC_I2C_RDATA : RO ;bitpos:[29:22] ;default: 8'h0 ; */
/*description: I2C read data*/
#define SARADC_I2C_RDATA  0x000000FF
#define SARADC_I2C_RDATA_M  ((SARADC_I2C_RDATA_V)<<(SARADC_I2C_RDATA_S))
#define SARADC_I2C_RDATA_V  0xFF
#define SARADC_I2C_RDATA_S  22
/* SARADC_I2C_SLAVE_ADDR6 : R/W ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR6  0x000007FF
#define SARADC_I2C_SLAVE_ADDR6_M  ((SARADC_I2C_SLAVE_ADDR6_V)<<(SARADC_I2C_SLAVE_ADDR6_S))
#define SARADC_I2C_SLAVE_ADDR6_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR6_S  11
/* SARADC_I2C_SLAVE_ADDR7 : R/W ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SARADC_I2C_SLAVE_ADDR7  0x000007FF
#define SARADC_I2C_SLAVE_ADDR7_M  ((SARADC_I2C_SLAVE_ADDR7_V)<<(SARADC_I2C_SLAVE_ADDR7_S))
#define SARADC_I2C_SLAVE_ADDR7_V  0x7FF
#define SARADC_I2C_SLAVE_ADDR7_S  0

#define SARADC_SAR_TSENS_CTRL_REG          (DR_REG_SARADC_BASE + 0x004c)
/* SARADC_TSENS_DUMP_OUT : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: temperature sensor dump out  only active when reg_tsens_power_up_force = 1*/
#define SARADC_TSENS_DUMP_OUT  (BIT(26))
#define SARADC_TSENS_DUMP_OUT_M  (BIT(26))
#define SARADC_TSENS_DUMP_OUT_V  0x1
#define SARADC_TSENS_DUMP_OUT_S  26
/* SARADC_TSENS_POWER_UP_FORCE : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: 1: dump out & power up controlled by SW  0: by FSM*/
#define SARADC_TSENS_POWER_UP_FORCE  (BIT(25))
#define SARADC_TSENS_POWER_UP_FORCE_M  (BIT(25))
#define SARADC_TSENS_POWER_UP_FORCE_V  0x1
#define SARADC_TSENS_POWER_UP_FORCE_S  25
/* SARADC_TSENS_POWER_UP : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: temperature sensor power up*/
#define SARADC_TSENS_POWER_UP  (BIT(24))
#define SARADC_TSENS_POWER_UP_M  (BIT(24))
#define SARADC_TSENS_POWER_UP_V  0x1
#define SARADC_TSENS_POWER_UP_S  24
/* SARADC_TSENS_CLK_DIV : R/W ;bitpos:[23:16] ;default: 8'd6 ; */
/*description: temperature sensor clock divider*/
#define SARADC_TSENS_CLK_DIV  0x000000FF
#define SARADC_TSENS_CLK_DIV_M  ((SARADC_TSENS_CLK_DIV_V)<<(SARADC_TSENS_CLK_DIV_S))
#define SARADC_TSENS_CLK_DIV_V  0xFF
#define SARADC_TSENS_CLK_DIV_S  16
/* SARADC_TSENS_IN_INV : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: invert temperature sensor data*/
#define SARADC_TSENS_IN_INV  (BIT(15))
#define SARADC_TSENS_IN_INV_M  (BIT(15))
#define SARADC_TSENS_IN_INV_V  0x1
#define SARADC_TSENS_IN_INV_S  15
/* SARADC_TSENS_CLK_GATED : R/W ;bitpos:[14] ;default: 1'b1 ; */
/*description: */
#define SARADC_TSENS_CLK_GATED  (BIT(14))
#define SARADC_TSENS_CLK_GATED_M  (BIT(14))
#define SARADC_TSENS_CLK_GATED_V  0x1
#define SARADC_TSENS_CLK_GATED_S  14
/* SARADC_TSENS_CLK_INV : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: */
#define SARADC_TSENS_CLK_INV  (BIT(13))
#define SARADC_TSENS_CLK_INV_M  (BIT(13))
#define SARADC_TSENS_CLK_INV_V  0x1
#define SARADC_TSENS_CLK_INV_S  13
/* SARADC_TSENS_XPD_FORCE : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SARADC_TSENS_XPD_FORCE  (BIT(12))
#define SARADC_TSENS_XPD_FORCE_M  (BIT(12))
#define SARADC_TSENS_XPD_FORCE_V  0x1
#define SARADC_TSENS_XPD_FORCE_S  12
/* SARADC_TSENS_XPD_WAIT : R/W ;bitpos:[11:0] ;default: 12'h2 ; */
/*description: */
#define SARADC_TSENS_XPD_WAIT  0x00000FFF
#define SARADC_TSENS_XPD_WAIT_M  ((SARADC_TSENS_XPD_WAIT_V)<<(SARADC_TSENS_XPD_WAIT_S))
#define SARADC_TSENS_XPD_WAIT_V  0xFFF
#define SARADC_TSENS_XPD_WAIT_S  0

#define SARADC_SAR_I2C_CTRL_REG          (DR_REG_SARADC_BASE + 0x0050)
/* SARADC_SAR_I2C_START_FORCE : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: 1: I2C started by SW  0: I2C started by FSM*/
#define SARADC_SAR_I2C_START_FORCE  (BIT(29))
#define SARADC_SAR_I2C_START_FORCE_M  (BIT(29))
#define SARADC_SAR_I2C_START_FORCE_V  0x1
#define SARADC_SAR_I2C_START_FORCE_S  29
/* SARADC_SAR_I2C_START : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: start I2C  only active when reg_sar_i2c_start_force = 1*/
#define SARADC_SAR_I2C_START  (BIT(28))
#define SARADC_SAR_I2C_START_M  (BIT(28))
#define SARADC_SAR_I2C_START_V  0x1
#define SARADC_SAR_I2C_START_S  28
/* SARADC_SAR_I2C_CTRL : R/W ;bitpos:[27:0] ;default: 28'b0 ; */
/*description: I2C control data  only active when reg_sar_i2c_start_force = 1*/
#define SARADC_SAR_I2C_CTRL  0x0FFFFFFF
#define SARADC_SAR_I2C_CTRL_M  ((SARADC_SAR_I2C_CTRL_V)<<(SARADC_SAR_I2C_CTRL_S))
#define SARADC_SAR_I2C_CTRL_V  0xFFFFFFF
#define SARADC_SAR_I2C_CTRL_S  0

