espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
#define SARADC_SAR_MEAS_START1_REG          (DR_REG_SARADC_BASE + 0x0054)
/* SARADC_SAR1_EN_PAD_FORCE : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: 1: SAR ADC1 pad enable bitmap is controlled by SW  0: SAR ADC1
 pad enable bitmap is controlled by ULP-coprocessor*/
#define SARADC_SAR1_EN_PAD_FORCE  (BIT(31))
#define SARADC_SAR1_EN_PAD_FORCE_M  (BIT(31))
#define SARADC_SAR1_EN_PAD_FORCE_V  0x1
#define SARADC_SAR1_EN_PAD_FORCE_S  31
/* SARADC_SAR1_EN_PAD : R/W ;bitpos:[30:19] ;default: 12'b0 ; */
/*description: SAR ADC1 pad enable bitmap  only active when reg_sar1_en_pad_force = 1*/
#define SARADC_SAR1_EN_PAD  0x00000FFF
#define SARADC_SAR1_EN_PAD_M  ((SARADC_SAR1_EN_PAD_V)<<(SARADC_SAR1_EN_PAD_S))
#define SARADC_SAR1_EN_PAD_V  0xFFF
#define SARADC_SAR1_EN_PAD_S  19
/* SARADC_MEAS1_START_FORCE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: 1: SAR ADC1 controller (in RTC) is started by SW  0: SAR ADC1
 controller is started by ULP-coprocessor*/
#define SARADC_MEAS1_START_FORCE  (BIT(18))
#define SARADC_MEAS1_START_FORCE_M  (BIT(18))
#define SARADC_MEAS1_START_FORCE_V  0x1
#define SARADC_MEAS1_START_FORCE_S  18
/* SARADC_MEAS1_START_SAR : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: SAR ADC1 controller (in RTC) starts conversion  only active when
 reg_meas1_start_force = 1*/
#define SARADC_MEAS1_START_SAR  (BIT(17))
#define SARADC_MEAS1_START_SAR_M  (BIT(17))
#define SARADC_MEAS1_START_SAR_V  0x1
#define SARADC_MEAS1_START_SAR_S  17
/* SARADC_MEAS1_DONE_SAR : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: SAR ADC1 conversion done indication*/
#define SARADC_MEAS1_DONE_SAR  (BIT(16))
#define SARADC_MEAS1_DONE_SAR_M  (BIT(16))
#define SARADC_MEAS1_DONE_SAR_V  0x1
#define SARADC_MEAS1_DONE_SAR_S  16
/* SARADC_MEAS1_DATA_SAR : RO ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: SAR ADC1 data*/
#define SARADC_MEAS1_DATA_SAR  0x0000FFFF
#define SARADC_MEAS1_DATA_SAR_M  ((SARADC_MEAS1_DATA_SAR_V)<<(SARADC_MEAS1_DATA_SAR_S))
#define SARADC_MEAS1_DATA_SAR_V  0xFFFF
#define SARADC_MEAS1_DATA_SAR_S  0

#define SARADC_SAR_TOUCH_CTRL1_REG          (DR_REG_SARADC_BASE + 0x0058)
/* SARADC_HALL_PHASE_FORCE : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: 1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled
 by FSM in ULP-coprocessor*/
#define SARADC_HALL_PHASE_FORCE  (BIT(27))
#define SARADC_HALL_PHASE_FORCE_M  (BIT(27))
#define SARADC_HALL_PHASE_FORCE_V  0x1
#define SARADC_HALL_PHASE_FORCE_S  27
/* SARADC_XPD_HALL_FORCE : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: 1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by
 FSM in ULP-coprocessor*/
#define SARADC_XPD_HALL_FORCE  (BIT(26))
#define SARADC_XPD_HALL_FORCE_M  (BIT(26))
#define SARADC_XPD_HALL_FORCE_V  0x1
#define SARADC_XPD_HALL_FORCE_S  26
/* SARADC_TOUCH_OUT_1EN : R/W ;bitpos:[25] ;default: 1'b1 ; */
/*description: 1: wakeup interrupt is generated if SET1 is ��touched��  0:
 wakeup interrupt is generated only if SET1 & SET2 is both ��touched��*/
#define SARADC_TOUCH_OUT_1EN  (BIT(25))
#define SARADC_TOUCH_OUT_1EN_M  (BIT(25))
#define SARADC_TOUCH_OUT_1EN_V  0x1
#define SARADC_TOUCH_OUT_1EN_S  25
/* SARADC_TOUCH_OUT_SEL : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: 1: when the counter is greater then the threshold  the touch
 pad is considered as ��touched��  0: when the counter is less than the threshold  the touch pad is considered as ��touched��*/
#define SARADC_TOUCH_OUT_SEL  (BIT(24))
#define SARADC_TOUCH_OUT_SEL_M  (BIT(24))
#define SARADC_TOUCH_OUT_SEL_V  0x1
#define SARADC_TOUCH_OUT_SEL_S  24
/* SARADC_TOUCH_XPD_WAIT : R/W ;bitpos:[23:16] ;default: 8'h4 ; */
/*description: the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD*/
#define SARADC_TOUCH_XPD_WAIT  0x000000FF
#define SARADC_TOUCH_XPD_WAIT_M  ((SARADC_TOUCH_XPD_WAIT_V)<<(SARADC_TOUCH_XPD_WAIT_S))
#define SARADC_TOUCH_XPD_WAIT_V  0xFF
#define SARADC_TOUCH_XPD_WAIT_S  16
/* SARADC_TOUCH_MEAS_DELAY : R/W ;bitpos:[15:0] ;default: 16'h1000 ; */
/*description: the meas length (in 8MHz)*/
#define SARADC_TOUCH_MEAS_DELAY  0x0000FFFF
#define SARADC_TOUCH_MEAS_DELAY_M  ((SARADC_TOUCH_MEAS_DELAY_V)<<(SARADC_TOUCH_MEAS_DELAY_S))
#define SARADC_TOUCH_MEAS_DELAY_V  0xFFFF
#define SARADC_TOUCH_MEAS_DELAY_S  0

#define SARADC_SAR_TOUCH_THRES1_REG          (DR_REG_SARADC_BASE + 0x005c)
/* SARADC_TOUCH_OUT_TH0 : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the threshold for touch pad 0*/
#define SARADC_TOUCH_OUT_TH0  0x0000FFFF
#define SARADC_TOUCH_OUT_TH0_M  ((SARADC_TOUCH_OUT_TH0_V)<<(SARADC_TOUCH_OUT_TH0_S))
#define SARADC_TOUCH_OUT_TH0_V  0xFFFF
#define SARADC_TOUCH_OUT_TH0_S  16
/* SARADC_TOUCH_OUT_TH1 : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the threshold for touch pad 1*/
#define SARADC_TOUCH_OUT_TH1  0x0000FFFF
#define SARADC_TOUCH_OUT_TH1_M  ((SARADC_TOUCH_OUT_TH1_V)<<(SARADC_TOUCH_OUT_TH1_S))
#define SARADC_TOUCH_OUT_TH1_V  0xFFFF
#define SARADC_TOUCH_OUT_TH1_S  0

#define SARADC_SAR_TOUCH_THRES2_REG          (DR_REG_SARADC_BASE + 0x0060)
/* SARADC_TOUCH_OUT_TH2 : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the threshold for touch pad 2*/
#define SARADC_TOUCH_OUT_TH2  0x0000FFFF
#define SARADC_TOUCH_OUT_TH2_M  ((SARADC_TOUCH_OUT_TH2_V)<<(SARADC_TOUCH_OUT_TH2_S))
#define SARADC_TOUCH_OUT_TH2_V  0xFFFF
#define SARADC_TOUCH_OUT_TH2_S  16
/* SARADC_TOUCH_OUT_TH3 : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the threshold for touch pad 3*/
#define SARADC_TOUCH_OUT_TH3  0x0000FFFF
#define SARADC_TOUCH_OUT_TH3_M  ((SARADC_TOUCH_OUT_TH3_V)<<(SARADC_TOUCH_OUT_TH3_S))
#define SARADC_TOUCH_OUT_TH3_V  0xFFFF
#define SARADC_TOUCH_OUT_TH3_S  0

#define SARADC_SAR_TOUCH_THRES3_REG          (DR_REG_SARADC_BASE + 0x0064)
/* SARADC_TOUCH_OUT_TH4 : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the threshold for touch pad 4*/
#define SARADC_TOUCH_OUT_TH4  0x0000FFFF
#define SARADC_TOUCH_OUT_TH4_M  ((SARADC_TOUCH_OUT_TH4_V)<<(SARADC_TOUCH_OUT_TH4_S))
#define SARADC_TOUCH_OUT_TH4_V  0xFFFF
#define SARADC_TOUCH_OUT_TH4_S  16
/* SARADC_TOUCH_OUT_TH5 : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the threshold for touch pad 5*/
#define SARADC_TOUCH_OUT_TH5  0x0000FFFF
#define SARADC_TOUCH_OUT_TH5_M  ((SARADC_TOUCH_OUT_TH5_V)<<(SARADC_TOUCH_OUT_TH5_S))
#define SARADC_TOUCH_OUT_TH5_V  0xFFFF
#define SARADC_TOUCH_OUT_TH5_S  0

#define SARADC_SAR_TOUCH_THRES4_REG          (DR_REG_SARADC_BASE + 0x0068)
/* SARADC_TOUCH_OUT_TH6 : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the threshold for touch pad 6*/
#define SARADC_TOUCH_OUT_TH6  0x0000FFFF
#define SARADC_TOUCH_OUT_TH6_M  ((SARADC_TOUCH_OUT_TH6_V)<<(SARADC_TOUCH_OUT_TH6_S))
#define SARADC_TOUCH_OUT_TH6_V  0xFFFF
#define SARADC_TOUCH_OUT_TH6_S  16
/* SARADC_TOUCH_OUT_TH7 : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the threshold for touch pad 7*/
#define SARADC_TOUCH_OUT_TH7  0x0000FFFF
#define SARADC_TOUCH_OUT_TH7_M  ((SARADC_TOUCH_OUT_TH7_V)<<(SARADC_TOUCH_OUT_TH7_S))
#define SARADC_TOUCH_OUT_TH7_V  0xFFFF
#define SARADC_TOUCH_OUT_TH7_S  0

#define SARADC_SAR_TOUCH_THRES5_REG          (DR_REG_SARADC_BASE + 0x006c)
/* SARADC_TOUCH_OUT_TH8 : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the threshold for touch pad 8*/
#define SARADC_TOUCH_OUT_TH8  0x0000FFFF
#define SARADC_TOUCH_OUT_TH8_M  ((SARADC_TOUCH_OUT_TH8_V)<<(SARADC_TOUCH_OUT_TH8_S))
#define SARADC_TOUCH_OUT_TH8_V  0xFFFF
#define SARADC_TOUCH_OUT_TH8_S  16
/* SARADC_TOUCH_OUT_TH9 : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the threshold for touch pad 9*/
#define SARADC_TOUCH_OUT_TH9  0x0000FFFF
#define SARADC_TOUCH_OUT_TH9_M  ((SARADC_TOUCH_OUT_TH9_V)<<(SARADC_TOUCH_OUT_TH9_S))
#define SARADC_TOUCH_OUT_TH9_V  0xFFFF
#define SARADC_TOUCH_OUT_TH9_S  0

#define SARADC_SAR_TOUCH_OUT1_REG          (DR_REG_SARADC_BASE + 0x0070)
/* SARADC_TOUCH_MEAS_OUT0 : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the counter for touch pad 0*/
#define SARADC_TOUCH_MEAS_OUT0  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT0_M  ((SARADC_TOUCH_MEAS_OUT0_V)<<(SARADC_TOUCH_MEAS_OUT0_S))
#define SARADC_TOUCH_MEAS_OUT0_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT0_S  16
/* SARADC_TOUCH_MEAS_OUT1 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the counter for touch pad 1*/
#define SARADC_TOUCH_MEAS_OUT1  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT1_M  ((SARADC_TOUCH_MEAS_OUT1_V)<<(SARADC_TOUCH_MEAS_OUT1_S))
#define SARADC_TOUCH_MEAS_OUT1_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT1_S  0

#define SARADC_SAR_TOUCH_OUT2_REG          (DR_REG_SARADC_BASE + 0x0074)
/* SARADC_TOUCH_MEAS_OUT2 : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the counter for touch pad 2*/
#define SARADC_TOUCH_MEAS_OUT2  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT2_M  ((SARADC_TOUCH_MEAS_OUT2_V)<<(SARADC_TOUCH_MEAS_OUT2_S))
#define SARADC_TOUCH_MEAS_OUT2_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT2_S  16
/* SARADC_TOUCH_MEAS_OUT3 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the counter for touch pad 3*/
#define SARADC_TOUCH_MEAS_OUT3  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT3_M  ((SARADC_TOUCH_MEAS_OUT3_V)<<(SARADC_TOUCH_MEAS_OUT3_S))
#define SARADC_TOUCH_MEAS_OUT3_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT3_S  0

#define SARADC_SAR_TOUCH_OUT3_REG          (DR_REG_SARADC_BASE + 0x0078)
/* SARADC_TOUCH_MEAS_OUT4 : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the counter for touch pad 4*/
#define SARADC_TOUCH_MEAS_OUT4  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT4_M  ((SARADC_TOUCH_MEAS_OUT4_V)<<(SARADC_TOUCH_MEAS_OUT4_S))
#define SARADC_TOUCH_MEAS_OUT4_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT4_S  16
/* SARADC_TOUCH_MEAS_OUT5 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the counter for touch pad 5*/
#define SARADC_TOUCH_MEAS_OUT5  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT5_M  ((SARADC_TOUCH_MEAS_OUT5_V)<<(SARADC_TOUCH_MEAS_OUT5_S))
#define SARADC_TOUCH_MEAS_OUT5_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT5_S  0

#define SARADC_SAR_TOUCH_OUT4_REG          (DR_REG_SARADC_BASE + 0x007c)
/* SARADC_TOUCH_MEAS_OUT6 : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the counter for touch pad 6*/
#define SARADC_TOUCH_MEAS_OUT6  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT6_M  ((SARADC_TOUCH_MEAS_OUT6_V)<<(SARADC_TOUCH_MEAS_OUT6_S))
#define SARADC_TOUCH_MEAS_OUT6_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT6_S  16
/* SARADC_TOUCH_MEAS_OUT7 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the counter for touch pad 7*/
#define SARADC_TOUCH_MEAS_OUT7  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT7_M  ((SARADC_TOUCH_MEAS_OUT7_V)<<(SARADC_TOUCH_MEAS_OUT7_S))
#define SARADC_TOUCH_MEAS_OUT7_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT7_S  0

#define SARADC_SAR_TOUCH_OUT5_REG          (DR_REG_SARADC_BASE + 0x0080)
/* SARADC_TOUCH_MEAS_OUT8 : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: the counter for touch pad 8*/
#define SARADC_TOUCH_MEAS_OUT8  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT8_M  ((SARADC_TOUCH_MEAS_OUT8_V)<<(SARADC_TOUCH_MEAS_OUT8_S))
#define SARADC_TOUCH_MEAS_OUT8_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT8_S  16
/* SARADC_TOUCH_MEAS_OUT9 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: the counter for touch pad 9*/
#define SARADC_TOUCH_MEAS_OUT9  0x0000FFFF
#define SARADC_TOUCH_MEAS_OUT9_M  ((SARADC_TOUCH_MEAS_OUT9_V)<<(SARADC_TOUCH_MEAS_OUT9_S))
#define SARADC_TOUCH_MEAS_OUT9_V  0xFFFF
#define SARADC_TOUCH_MEAS_OUT9_S  0

#define SARADC_SAR_TOUCH_CTRL2_REG          (DR_REG_SARADC_BASE + 0x0084)
/* SARADC_TOUCH_MEAS_EN_CLR : WO ;bitpos:[30] ;default: 1'h0 ; */
/*description: to clear reg_touch_meas_en*/
#define SARADC_TOUCH_MEAS_EN_CLR  (BIT(30))
#define SARADC_TOUCH_MEAS_EN_CLR_M  (BIT(30))
#define SARADC_TOUCH_MEAS_EN_CLR_V  0x1
#define SARADC_TOUCH_MEAS_EN_CLR_S  30
/* SARADC_TOUCH_SLEEP_CYCLES : R/W ;bitpos:[29:14] ;default: 16'h100 ; */
/*description: sleep cycles for timer*/
#define SARADC_TOUCH_SLEEP_CYCLES  0x0000FFFF
#define SARADC_TOUCH_SLEEP_CYCLES_M  ((SARADC_TOUCH_SLEEP_CYCLES_V)<<(SARADC_TOUCH_SLEEP_CYCLES_S))
#define SARADC_TOUCH_SLEEP_CYCLES_V  0xFFFF
#define SARADC_TOUCH_SLEEP_CYCLES_S  14
/* SARADC_TOUCH_START_FORCE : R/W ;bitpos:[13] ;default: 1'h0 ; */
/*description: 1: to start touch fsm by SW  0: to start touch fsm by timer*/
#define SARADC_TOUCH_START_FORCE  (BIT(13))
#define SARADC_TOUCH_START_FORCE_M  (BIT(13))
#define SARADC_TOUCH_START_FORCE_V  0x1
#define SARADC_TOUCH_START_FORCE_S  13
/* SARADC_TOUCH_START_EN : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: 1: start touch fsm  valid when reg_touch_start_force is set*/
#define SARADC_TOUCH_START_EN  (BIT(12))
#define SARADC_TOUCH_START_EN_M  (BIT(12))
#define SARADC_TOUCH_START_EN_V  0x1
#define SARADC_TOUCH_START_EN_S  12
/* SARADC_TOUCH_START_FSM_EN : R/W ;bitpos:[11] ;default: 1'h1 ; */
/*description: 1: TOUCH_START & TOUCH_XPD is controlled by touch fsm  0: TOUCH_START
 & TOUCH_XPD is controlled by registers*/
#define SARADC_TOUCH_START_FSM_EN  (BIT(11))
#define SARADC_TOUCH_START_FSM_EN_M  (BIT(11))
#define SARADC_TOUCH_START_FSM_EN_V  0x1
#define SARADC_TOUCH_START_FSM_EN_S  11
/* SARADC_TOUCH_MEAS_DONE : RO ;bitpos:[10] ;default: 1'h0 ; */
/*description: fsm set 1 to indicate touch touch meas is done*/
#define SARADC_TOUCH_MEAS_DONE  (BIT(10))
#define SARADC_TOUCH_MEAS_DONE_M  (BIT(10))
#define SARADC_TOUCH_MEAS_DONE_V  0x1
#define SARADC_TOUCH_MEAS_DONE_S  10
/* SARADC_TOUCH_MEAS_EN : RO ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: 10-bit register to indicate which pads are ��touched��*/
#define SARADC_TOUCH_MEAS_EN  0x000003FF
#define SARADC_TOUCH_MEAS_EN_M  ((SARADC_TOUCH_MEAS_EN_V)<<(SARADC_TOUCH_MEAS_EN_S))
#define SARADC_TOUCH_MEAS_EN_V  0x3FF
#define SARADC_TOUCH_MEAS_EN_S  0

#define SARADC_SAR_TOUCH_ENABLE_REG          (DR_REG_SARADC_BASE + 0x008c)
/* SARADC_TOUCH_PAD_OUTEN1 : R/W ;bitpos:[29:20] ;default: 10'h3ff ; */
/*description: Bitmap defining SET1 for generating wakeup interrupt. SET1 is
 ��touched�� only if at least one of touch pad in SET1 is ��touched��.*/
#define SARADC_TOUCH_PAD_OUTEN1  0x000003FF
#define SARADC_TOUCH_PAD_OUTEN1_M  ((SARADC_TOUCH_PAD_OUTEN1_V)<<(SARADC_TOUCH_PAD_OUTEN1_S))
#define SARADC_TOUCH_PAD_OUTEN1_V  0x3FF
#define SARADC_TOUCH_PAD_OUTEN1_S  20
/* SARADC_TOUCH_PAD_OUTEN2 : R/W ;bitpos:[19:10] ;default: 10'h3ff ; */
/*description: Bitmap defining SET2 for generating wakeup interrupt. SET2 is
 ��touched�� only if at least one of touch pad in SET2 is ��touched��.*/
#define SARADC_TOUCH_PAD_OUTEN2  0x000003FF
#define SARADC_TOUCH_PAD_OUTEN2_M  ((SARADC_TOUCH_PAD_OUTEN2_V)<<(SARADC_TOUCH_PAD_OUTEN2_S))
#define SARADC_TOUCH_PAD_OUTEN2_V  0x3FF
#define SARADC_TOUCH_PAD_OUTEN2_S  10
/* SARADC_TOUCH_PAD_WORKEN : R/W ;bitpos:[9:0] ;default: 10'h3ff ; */
/*description: Bitmap defining the working set during the measurement.*/
#define SARADC_TOUCH_PAD_WORKEN  0x000003FF
#define SARADC_TOUCH_PAD_WORKEN_M  ((SARADC_TOUCH_PAD_WORKEN_V)<<(SARADC_TOUCH_PAD_WORKEN_S))
#define SARADC_TOUCH_PAD_WORKEN_V  0x3FF
#define SARADC_TOUCH_PAD_WORKEN_S  0

