espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
#define SARADC_SAR_READ_CTRL2_REG          (DR_REG_SARADC_BASE + 0x0090)
/* SARADC_SAR2_DATA_INV : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Invert SAR ADC2 data*/
#define SARADC_SAR2_DATA_INV  (BIT(29))
#define SARADC_SAR2_DATA_INV_M  (BIT(29))
#define SARADC_SAR2_DATA_INV_V  0x1
#define SARADC_SAR2_DATA_INV_S  29
/* SARADC_SAR2_DIG_FORCE : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: 1: SAR ADC2 controlled by DIG ADC2 CTRL or PWDET CTRL  0: SAR
 ADC2 controlled by RTC ADC2 CTRL*/
#define SARADC_SAR2_DIG_FORCE  (BIT(28))
#define SARADC_SAR2_DIG_FORCE_M  (BIT(28))
#define SARADC_SAR2_DIG_FORCE_V  0x1
#define SARADC_SAR2_DIG_FORCE_S  28
/* SARADC_SAR2_PWDET_FORCE : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SARADC_SAR2_PWDET_FORCE  (BIT(27))
#define SARADC_SAR2_PWDET_FORCE_M  (BIT(27))
#define SARADC_SAR2_PWDET_FORCE_V  0x1
#define SARADC_SAR2_PWDET_FORCE_S  27
/* SARADC_SAR2_SAMPLE_NUM : R/W ;bitpos:[26:19] ;default: 8'd0 ; */
/*description: */
#define SARADC_SAR2_SAMPLE_NUM  0x000000FF
#define SARADC_SAR2_SAMPLE_NUM_M  ((SARADC_SAR2_SAMPLE_NUM_V)<<(SARADC_SAR2_SAMPLE_NUM_S))
#define SARADC_SAR2_SAMPLE_NUM_V  0xFF
#define SARADC_SAR2_SAMPLE_NUM_S  19
/* SARADC_SAR2_CLK_GATED : R/W ;bitpos:[18] ;default: 1'b1 ; */
/*description: */
#define SARADC_SAR2_CLK_GATED  (BIT(18))
#define SARADC_SAR2_CLK_GATED_M  (BIT(18))
#define SARADC_SAR2_CLK_GATED_V  0x1
#define SARADC_SAR2_CLK_GATED_S  18
/* SARADC_SAR2_SAMPLE_BIT : R/W ;bitpos:[17:16] ;default: 2'd3 ; */
/*description: 00: for 9-bit width  01: for 10-bit width  10: for 11-bit width
  11: for 12-bit width*/
#define SARADC_SAR2_SAMPLE_BIT  0x00000003
#define SARADC_SAR2_SAMPLE_BIT_M  ((SARADC_SAR2_SAMPLE_BIT_V)<<(SARADC_SAR2_SAMPLE_BIT_S))
#define SARADC_SAR2_SAMPLE_BIT_V  0x3
#define SARADC_SAR2_SAMPLE_BIT_S  16
/* SARADC_SAR2_SAMPLE_CYCLE : R/W ;bitpos:[15:8] ;default: 8'd9 ; */
/*description: sample cycles for SAR ADC2*/
#define SARADC_SAR2_SAMPLE_CYCLE  0x000000FF
#define SARADC_SAR2_SAMPLE_CYCLE_M  ((SARADC_SAR2_SAMPLE_CYCLE_V)<<(SARADC_SAR2_SAMPLE_CYCLE_S))
#define SARADC_SAR2_SAMPLE_CYCLE_V  0xFF
#define SARADC_SAR2_SAMPLE_CYCLE_S  8
/* SARADC_SAR2_CLK_DIV : R/W ;bitpos:[7:0] ;default: 8'd2 ; */
/*description: clock divider*/
#define SARADC_SAR2_CLK_DIV  0x000000FF
#define SARADC_SAR2_CLK_DIV_M  ((SARADC_SAR2_CLK_DIV_V)<<(SARADC_SAR2_CLK_DIV_S))
#define SARADC_SAR2_CLK_DIV_V  0xFF
#define SARADC_SAR2_CLK_DIV_S  0

#define SARADC_SAR_MEAS_START2_REG          (DR_REG_SARADC_BASE + 0x0094)
/* SARADC_SAR2_EN_PAD_FORCE : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: 1: SAR ADC2 pad enable bitmap is controlled by SW  0: SAR ADC2
 pad enable bitmap is controlled by ULP-coprocessor*/
#define SARADC_SAR2_EN_PAD_FORCE  (BIT(31))
#define SARADC_SAR2_EN_PAD_FORCE_M  (BIT(31))
#define SARADC_SAR2_EN_PAD_FORCE_V  0x1
#define SARADC_SAR2_EN_PAD_FORCE_S  31
/* SARADC_SAR2_EN_PAD : R/W ;bitpos:[30:19] ;default: 12'b0 ; */
/*description: SAR ADC2 pad enable bitmap  only active when reg_sar2_en_pad_force = 1*/
#define SARADC_SAR2_EN_PAD  0x00000FFF
#define SARADC_SAR2_EN_PAD_M  ((SARADC_SAR2_EN_PAD_V)<<(SARADC_SAR2_EN_PAD_S))
#define SARADC_SAR2_EN_PAD_V  0xFFF
#define SARADC_SAR2_EN_PAD_S  19
/* SARADC_MEAS2_START_FORCE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: 1: SAR ADC2 controller (in RTC) is started by SW  0: SAR ADC2
 controller is started by ULP-coprocessor*/
#define SARADC_MEAS2_START_FORCE  (BIT(18))
#define SARADC_MEAS2_START_FORCE_M  (BIT(18))
#define SARADC_MEAS2_START_FORCE_V  0x1
#define SARADC_MEAS2_START_FORCE_S  18
/* SARADC_MEAS2_START_SAR : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: SAR ADC2 controller (in RTC) starts conversion  only active when
 reg_meas2_start_force = 1*/
#define SARADC_MEAS2_START_SAR  (BIT(17))
#define SARADC_MEAS2_START_SAR_M  (BIT(17))
#define SARADC_MEAS2_START_SAR_V  0x1
#define SARADC_MEAS2_START_SAR_S  17
/* SARADC_MEAS2_DONE_SAR : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: SAR ADC2 conversion done indication*/
#define SARADC_MEAS2_DONE_SAR  (BIT(16))
#define SARADC_MEAS2_DONE_SAR_M  (BIT(16))
#define SARADC_MEAS2_DONE_SAR_V  0x1
#define SARADC_MEAS2_DONE_SAR_S  16
/* SARADC_MEAS2_DATA_SAR : RO ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: SAR ADC2 data*/
#define SARADC_MEAS2_DATA_SAR  0x0000FFFF
#define SARADC_MEAS2_DATA_SAR_M  ((SARADC_MEAS2_DATA_SAR_V)<<(SARADC_MEAS2_DATA_SAR_S))
#define SARADC_MEAS2_DATA_SAR_V  0xFFFF
#define SARADC_MEAS2_DATA_SAR_S  0

#define SARADC_SAR_DAC_CTRL1_REG          (DR_REG_SARADC_BASE + 0x0098)
/* SARADC_DAC_CLK_INV : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: 1: invert PDAC_CLK*/
#define SARADC_DAC_CLK_INV  (BIT(25))
#define SARADC_DAC_CLK_INV_M  (BIT(25))
#define SARADC_DAC_CLK_INV_V  0x1
#define SARADC_DAC_CLK_INV_S  25
/* SARADC_DAC_CLK_FORCE_HIGH : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: 1: force PDAC_CLK to high*/
#define SARADC_DAC_CLK_FORCE_HIGH  (BIT(24))
#define SARADC_DAC_CLK_FORCE_HIGH_M  (BIT(24))
#define SARADC_DAC_CLK_FORCE_HIGH_V  0x1
#define SARADC_DAC_CLK_FORCE_HIGH_S  24
/* SARADC_DAC_CLK_FORCE_LOW : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: 1: force PDAC_CLK to low*/
#define SARADC_DAC_CLK_FORCE_LOW  (BIT(23))
#define SARADC_DAC_CLK_FORCE_LOW_M  (BIT(23))
#define SARADC_DAC_CLK_FORCE_LOW_V  0x1
#define SARADC_DAC_CLK_FORCE_LOW_S  23
/* SARADC_DAC_DIG_FORCE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: 1: DAC1 & DAC2 use DMA  0: DAC1 & DAC2 do not use DMA*/
#define SARADC_DAC_DIG_FORCE  (BIT(22))
#define SARADC_DAC_DIG_FORCE_M  (BIT(22))
#define SARADC_DAC_DIG_FORCE_V  0x1
#define SARADC_DAC_DIG_FORCE_S  22
/* SARADC_DEBUG_BIT_SEL : R/W ;bitpos:[21:17] ;default: 5'b0 ; */
/*description: */
#define SARADC_DEBUG_BIT_SEL  0x0000001F
#define SARADC_DEBUG_BIT_SEL_M  ((SARADC_DEBUG_BIT_SEL_V)<<(SARADC_DEBUG_BIT_SEL_S))
#define SARADC_DEBUG_BIT_SEL_V  0x1F
#define SARADC_DEBUG_BIT_SEL_S  17
/* SARADC_SW_TONE_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: 1: enable CW generator  0: disable CW generator*/
#define SARADC_SW_TONE_EN  (BIT(16))
#define SARADC_SW_TONE_EN_M  (BIT(16))
#define SARADC_SW_TONE_EN_V  0x1
#define SARADC_SW_TONE_EN_S  16
/* SARADC_SW_FSTEP : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: frequency step for CW generator  can be used to adjust the frequency*/
#define SARADC_SW_FSTEP  0x0000FFFF
#define SARADC_SW_FSTEP_M  ((SARADC_SW_FSTEP_V)<<(SARADC_SW_FSTEP_S))
#define SARADC_SW_FSTEP_V  0xFFFF
#define SARADC_SW_FSTEP_S  0

