espressif/esp-idf/components/esp32/include/soc/saradc_reg.h
#define SARADC_SAR_DAC_CTRL2_REG          (DR_REG_SARADC_BASE + 0x009c)
/* SARADC_DAC_CW_EN2 : R/W ;bitpos:[25] ;default: 1'b1 ; */
/*description: 1: to select CW generator as source to PDAC2_DAC[7:0]  0: to
 select register reg_pdac2_dac[7:0] as source to PDAC2_DAC[7:0]*/
#define SARADC_DAC_CW_EN2  (BIT(25))
#define SARADC_DAC_CW_EN2_M  (BIT(25))
#define SARADC_DAC_CW_EN2_V  0x1
#define SARADC_DAC_CW_EN2_S  25
/* SARADC_DAC_CW_EN1 : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: 1: to select CW generator as source to PDAC1_DAC[7:0]  0: to
 select register reg_pdac1_dac[7:0] as source to PDAC1_DAC[7:0]*/
#define SARADC_DAC_CW_EN1  (BIT(24))
#define SARADC_DAC_CW_EN1_M  (BIT(24))
#define SARADC_DAC_CW_EN1_V  0x1
#define SARADC_DAC_CW_EN1_S  24
/* SARADC_DAC_INV2 : R/W ;bitpos:[23:22] ;default: 2'b0 ; */
/*description: 00: do not invert any bits  01: invert all bits  10: invert MSB
  11: invert all bits except MSB*/
#define SARADC_DAC_INV2  0x00000003
#define SARADC_DAC_INV2_M  ((SARADC_DAC_INV2_V)<<(SARADC_DAC_INV2_S))
#define SARADC_DAC_INV2_V  0x3
#define SARADC_DAC_INV2_S  22
/* SARADC_DAC_INV1 : R/W ;bitpos:[21:20] ;default: 2'b0 ; */
/*description: 00: do not invert any bits  01: invert all bits  10: invert MSB
  11: invert all bits except MSB*/
#define SARADC_DAC_INV1  0x00000003
#define SARADC_DAC_INV1_M  ((SARADC_DAC_INV1_V)<<(SARADC_DAC_INV1_S))
#define SARADC_DAC_INV1_V  0x3
#define SARADC_DAC_INV1_S  20
/* SARADC_DAC_SCALE2 : R/W ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: 00: no scale  01: scale to 1/2  10: scale to 1/4  scale to 1/8*/
#define SARADC_DAC_SCALE2  0x00000003
#define SARADC_DAC_SCALE2_M  ((SARADC_DAC_SCALE2_V)<<(SARADC_DAC_SCALE2_S))
#define SARADC_DAC_SCALE2_V  0x3
#define SARADC_DAC_SCALE2_S  18
/* SARADC_DAC_SCALE1 : R/W ;bitpos:[17:16] ;default: 2'b0 ; */
/*description: 00: no scale  01: scale to 1/2  10: scale to 1/4  scale to 1/8*/
#define SARADC_DAC_SCALE1  0x00000003
#define SARADC_DAC_SCALE1_M  ((SARADC_DAC_SCALE1_V)<<(SARADC_DAC_SCALE1_S))
#define SARADC_DAC_SCALE1_V  0x3
#define SARADC_DAC_SCALE1_S  16
/* SARADC_DAC_DC2 : R/W ;bitpos:[15:8] ;default: 8'b0 ; */
/*description: DC offset for DAC2 CW generator*/
#define SARADC_DAC_DC2  0x000000FF
#define SARADC_DAC_DC2_M  ((SARADC_DAC_DC2_V)<<(SARADC_DAC_DC2_S))
#define SARADC_DAC_DC2_V  0xFF
#define SARADC_DAC_DC2_S  8
/* SARADC_DAC_DC1 : R/W ;bitpos:[7:0] ;default: 8'b0 ; */
/*description: DC offset for DAC1 CW generator*/
#define SARADC_DAC_DC1  0x000000FF
#define SARADC_DAC_DC1_M  ((SARADC_DAC_DC1_V)<<(SARADC_DAC_DC1_S))
#define SARADC_DAC_DC1_V  0xFF
#define SARADC_DAC_DC1_S  0

#define SARADC_SAR_MEAS_CTRL2_REG          (DR_REG_SARADC_BASE + 0x0a0)
/* SARADC_AMP_SHORT_REF_GND_FORCE : R/W ;bitpos:[18:17] ;default: 2'b0 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_GND_FORCE  0x00000003
#define SARADC_AMP_SHORT_REF_GND_FORCE_M  ((SARADC_AMP_SHORT_REF_GND_FORCE_V)<<(SARADC_AMP_SHORT_REF_GND_FORCE_S))
#define SARADC_AMP_SHORT_REF_GND_FORCE_V  0x3
#define SARADC_AMP_SHORT_REF_GND_FORCE_S  17
/* SARADC_AMP_SHORT_REF_FORCE : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_FORCE  0x00000003
#define SARADC_AMP_SHORT_REF_FORCE_M  ((SARADC_AMP_SHORT_REF_FORCE_V)<<(SARADC_AMP_SHORT_REF_FORCE_S))
#define SARADC_AMP_SHORT_REF_FORCE_V  0x3
#define SARADC_AMP_SHORT_REF_FORCE_S  15
/* SARADC_AMP_RST_FB_FORCE : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: */
#define SARADC_AMP_RST_FB_FORCE  0x00000003
#define SARADC_AMP_RST_FB_FORCE_M  ((SARADC_AMP_RST_FB_FORCE_V)<<(SARADC_AMP_RST_FB_FORCE_S))
#define SARADC_AMP_RST_FB_FORCE_V  0x3
#define SARADC_AMP_RST_FB_FORCE_S  13
/* SARADC_SAR2_RSTB_FORCE : R/W ;bitpos:[12:11] ;default: 2'b0 ; */
/*description: */
#define SARADC_SAR2_RSTB_FORCE  0x00000003
#define SARADC_SAR2_RSTB_FORCE_M  ((SARADC_SAR2_RSTB_FORCE_V)<<(SARADC_SAR2_RSTB_FORCE_S))
#define SARADC_SAR2_RSTB_FORCE_V  0x3
#define SARADC_SAR2_RSTB_FORCE_S  11
/* SARADC_SAR_RSTB_FSM_IDLE : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SARADC_SAR_RSTB_FSM_IDLE  (BIT(10))
#define SARADC_SAR_RSTB_FSM_IDLE_M  (BIT(10))
#define SARADC_SAR_RSTB_FSM_IDLE_V  0x1
#define SARADC_SAR_RSTB_FSM_IDLE_S  10
/* SARADC_XPD_SAR_FSM_IDLE : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SARADC_XPD_SAR_FSM_IDLE  (BIT(9))
#define SARADC_XPD_SAR_FSM_IDLE_M  (BIT(9))
#define SARADC_XPD_SAR_FSM_IDLE_V  0x1
#define SARADC_XPD_SAR_FSM_IDLE_S  9
/* SARADC_AMP_SHORT_REF_GND_FSM_IDLE : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_GND_FSM_IDLE  (BIT(8))
#define SARADC_AMP_SHORT_REF_GND_FSM_IDLE_M  (BIT(8))
#define SARADC_AMP_SHORT_REF_GND_FSM_IDLE_V  0x1
#define SARADC_AMP_SHORT_REF_GND_FSM_IDLE_S  8
/* SARADC_AMP_SHORT_REF_FSM_IDLE : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SARADC_AMP_SHORT_REF_FSM_IDLE  (BIT(7))
#define SARADC_AMP_SHORT_REF_FSM_IDLE_M  (BIT(7))
#define SARADC_AMP_SHORT_REF_FSM_IDLE_V  0x1
#define SARADC_AMP_SHORT_REF_FSM_IDLE_S  7
/* SARADC_AMP_RST_FB_FSM_IDLE : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SARADC_AMP_RST_FB_FSM_IDLE  (BIT(6))
#define SARADC_AMP_RST_FB_FSM_IDLE_M  (BIT(6))
#define SARADC_AMP_RST_FB_FSM_IDLE_V  0x1
#define SARADC_AMP_RST_FB_FSM_IDLE_S  6
/* SARADC_XPD_SAR_AMP_FSM_IDLE : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SARADC_XPD_SAR_AMP_FSM_IDLE  (BIT(5))
#define SARADC_XPD_SAR_AMP_FSM_IDLE_M  (BIT(5))
#define SARADC_XPD_SAR_AMP_FSM_IDLE_V  0x1
#define SARADC_XPD_SAR_AMP_FSM_IDLE_S  5
/* SARADC_SAR1_DAC_XPD_FSM_IDLE : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SARADC_SAR1_DAC_XPD_FSM_IDLE  (BIT(4))
#define SARADC_SAR1_DAC_XPD_FSM_IDLE_M  (BIT(4))
#define SARADC_SAR1_DAC_XPD_FSM_IDLE_V  0x1
#define SARADC_SAR1_DAC_XPD_FSM_IDLE_S  4
/* SARADC_SAR1_DAC_XPD_FSM : R/W ;bitpos:[3:0] ;default: 4'b0011 ; */
/*description: */
#define SARADC_SAR1_DAC_XPD_FSM  0x0000000F
#define SARADC_SAR1_DAC_XPD_FSM_M  ((SARADC_SAR1_DAC_XPD_FSM_V)<<(SARADC_SAR1_DAC_XPD_FSM_S))
#define SARADC_SAR1_DAC_XPD_FSM_V  0xF
#define SARADC_SAR1_DAC_XPD_FSM_S  0

#define SARADC_SAR_NOUSE_REG          (DR_REG_SARADC_BASE + 0x00F8)
/* SARADC_SAR_NOUSE : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SARADC_SAR_NOUSE  0xFFFFFFFF
#define SARADC_SAR_NOUSE_M  ((SARADC_SAR_NOUSE_V)<<(SARADC_SAR_NOUSE_S))
#define SARADC_SAR_NOUSE_V  0xFFFFFFFF
#define SARADC_SAR_NOUSE_S  0

#define SARADC_SARDATE_REG          (DR_REG_SARADC_BASE + 0x00FC)
/* SARADC_SAR_DATE : R/W ;bitpos:[27:0] ;default: 28'h1605180 ; */
/*description: */
#define SARADC_SAR_DATE  0x0FFFFFFF
#define SARADC_SAR_DATE_M  ((SARADC_SAR_DATE_V)<<(SARADC_SAR_DATE_S))
#define SARADC_SAR_DATE_V  0xFFFFFFF
#define SARADC_SAR_DATE_S  0




#endif /*_SOC_SARADC_REG_H_ */


